AriaSignature-Cfe/Documents/АС_ДокументДискиИАрхивацияAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АС_ДокументДискиИАрхивацияAria</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АС_РегистрДискиAria</xr:Item>
				<xr:Item>InformationRegister.АС_РегистрАрхивацииAria</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КомпьютерыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Диски</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диск</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здоровье</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Температура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОбновленияДиски</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свободно</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Занято</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Архивации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКБазе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКАрхиву</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОбновленияАрхивации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполненияЗадачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОСистеме</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОбновленияСистемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HostName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОперационнаяСистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОЗУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IPАдреса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процессор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видеокарта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AriaSignature-Cfe/Catalogs/АС_КомпьютерыAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_КомпьютерыAria</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AriaSignature-Cfe/Documents/АС_ДокументДискиИАрхивацияAria/Forms/ФормаДокумента/Ext/Form/Module.bsl
//+ BAS 24.05.2026 : Заполнение документа через общий модуль Melezh

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрименитьСостояниеПоляКомпьютер();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Компьютер = Неопределено;
	ПрименитьСостояниеПоляКомпьютер();
КонецПроцедуры

&НаКлиенте
Процедура КомпьютерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Компьютер) И Не КомпьютерАктивенНаСервере(Объект.Компьютер) Тогда
		Сообщить("Этот компьютер в данный момент не активен. Пометьте справочник на удаление или проверьте работу устройства.");
		Объект.Компьютер = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомпьютерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщить("Сначала выберите контрагента.");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомпьютера(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	ДанныеВыбораПК = ИзвлечьДанныеКомпьютераИзРезультатаВыбора(ВыбранноеЗначение);
	Если ДанныеВыбораПК = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеВыбораПК.Активен Тогда
		Сообщить("Этот компьютер в данный момент не активен. Пометьте справочник на удаление или проверьте работу устройства.");
		Объект.Компьютер = Неопределено;
		Возврат;
	КонецЕсли;
	
	Объект.Компьютер = ДанныеВыбораПК.Ссылка;
	КомпьютерПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьДанныеКомпьютераИзРезультатаВыбора(РезультатВыбора)
	Если РезультатВыбора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ТипЗнч(РезультатВыбора) = Тип("Массив") Тогда
		Если РезультатВыбора.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		РезультатВыбора = РезультатВыбора[0];
	КонецЕсли;

	Если ТипЗнч(РезультатВыбора) = Тип("ЭлементСпискаЗначений") Тогда
		РезультатВыбора = РезультатВыбора.Значение;
	КонецЕсли;

	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ЗначениеВыбора = Неопределено;
		Если РезультатВыбора.Свойство("ВыбранноеЗначение", ЗначениеВыбора) Тогда
			РезультатВыбора = ЗначениеВыбора;
		ИначеЕсли РезультатВыбора.Свойство("Значение", ЗначениеВыбора) Тогда
			РезультатВыбора = ЗначениеВыбора;
		ИначеЕсли РезультатВыбора.Свойство("Ссылка", ЗначениеВыбора) Тогда
			РезультатВыбора = ЗначениеВыбора;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Ссылка", РезультатВыбора);
	СтруктураРезультата.Вставить("Активен", КомпьютерАктивенНаСервере(РезультатВыбора));
	СтруктураРезультата.Вставить("Представление", Строка(РезультатВыбора));
	Возврат СтруктураРезультата;
КонецФункции

&НаКлиенте
Процедура ПрименитьСостояниеПоляКомпьютер()
	ЭлементКомпьютер = Элементы.Найти("Компьютер");
	Если ЭлементКомпьютер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЛокальныеПараметрыВыбора = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЭлементКомпьютер.Доступность = Истина;
		ЭлементКомпьютер.ТолькоПросмотр = Ложь;
		ЛокальныеПараметрыВыбора.Добавить(Новый ПараметрВыбора("КонтрагентПК", Объект.Контрагент));
	Иначе
		ЭлементКомпьютер.Доступность = Ложь;
		ЭлементКомпьютер.ТолькоПросмотр = Истина;
		Объект.Компьютер = Неопределено;
	КонецЕсли;
	
	ЭлементКомпьютер.ПараметрыВыбора = Новый ФиксированныйМассив(ЛокальныеПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДаннымиИзПрограммы(Команда)
	Попытка
		ЗаполнитьДаннымиИзПрограммыНаСервере();
		Сообщить("Документ заполнен данными из Melezh.");
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщить(СформироватьПонятноеСообщениеОшибки(ТекстОшибки));
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиИзПрограммыНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Контрагент) ИЛИ Не ЗначениеЗаполнено(Объект.Компьютер) Тогда
		ВызватьИсключение "Для заполнения укажите контрагента и компьютер.";
	КонецЕсли;
	
	ДанныеMelezh = АС_ПодключениеКMelezh.ПолучитьДанныеMelezh(Объект.Контрагент, Объект.Компьютер, Ложь);
	Мета = ДанныеMelezh.Получить("meta");
	Если Мета = Неопределено Тогда
		ВызватьИсключение "Не удалось получить метаданные ответа Melezh.";
	КонецЕсли;
	
	Если Не Мета.Получить("isReady") Тогда
		СтатусПодключения = Мета.Получить("connectionStatus");
		Если СтатусПодключения = "Ошибка подключения" Тогда
			ВызватьИсключение "Не удалось установить подключение. Проверьте работу службы на этом компьютере.";
		КонецЕсли;
		
		ТекстОшибки = ЗначениеВСтроку(Мета.Получить("error"));
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = "Не удалось получить данные диагностики из программы.";
		КонецЕсли;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	АС_ПодключениеКMelezh.ЗаполнитьОбъектДиагностики(Объект, ДанныеMelezh);
	УстановитьДатуДокументаИзТабличныхЧастейНаСервере(Мета);
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуДокументаИзТабличныхЧастейНаСервере(Мета)
	СтрокаДаты = "";
	Если Объект.ОСистеме.Количество() > 0 Тогда
		СтрокаДаты = Объект.ОСистеме[0].ДатаПоследнегоОбновленияСистемы;
	ИначеЕсли Объект.Диски.Количество() > 0 Тогда
		СтрокаДаты = Объект.Диски[0].ДатаПоследнегоОбновленияДиски;
	ИначеЕсли Объект.Архивации.Количество() > 0 Тогда
		СтрокаДаты = Объект.Архивации[0].ДатаПоследнегоОбновленияАрхивации;
	Иначе
		СтрокаДаты = "";
	КонецЕсли;
	
	ДатаЗначение = ПопыткаПреобразоватьВДату(СтрокаДаты);
	Если ДатаЗначение = Неопределено И Мета <> Неопределено Тогда
		ДатаЗначение = ПопыткаПреобразоватьВДату(Мета.Получить("actualAt"));
	КонецЕсли;
	Если ДатаЗначение = Неопределено Тогда
		ДатаЗначение = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Объект.ДатаДокумента = ДатаЗначение;
КонецПроцедуры

&НаСервере
Функция ПопыткаПреобразоватьВДату(ЗначениеДаты)
	Если Не ЗначениеЗаполнено(ЗначениеДаты) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеДаты) = Тип("Дата") Тогда
		Возврат ЗначениеДаты;
	КонецЕсли;
	
	ТекстДаты = СокрЛП(Строка(ЗначениеДаты));
	Если Не ЗначениеЗаполнено(ТекстДаты) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрНайти(ТекстДаты, "T") > 0 Тогда
		ТекстДаты = СтрЗаменить(ТекстДаты, "T", " ");
	КонецЕсли;
	Если СтрНайти(ТекстДаты, "Z") > 0 Тогда
		ТекстДаты = СтрЗаменить(ТекстДаты, "Z", "");
	КонецЕсли;
	Если СтрНайти(ТекстДаты, "+") > 0 Тогда
		ТекстДаты = Лев(ТекстДаты, СтрНайти(ТекстДаты, "+") - 1);
	КонецЕсли;
	
	Попытка
		Возврат Дата(ТекстДаты);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Функция КомпьютерАктивенНаСервере(Знач Компьютер)
	СсылкаПК = НайтиСсылкуКомпьютераНаСервере(Компьютер);
	Если СсылкаПК = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Компьютеры.Активен КАК Активен
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаПК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Активен;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПолучитьКомпьютерыКонтрагентаНаСервере(Знач Контрагент)
	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Компьютеры.Ссылка КАК Ссылка,
	|	Компьютеры.Наименование КАК Наименование,
	|	Компьютеры.Код КАК Код,
	|	Компьютеры.Активен КАК Активен
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.КонтрагентПК = &Контрагент
	|УПОРЯДОЧИТЬ ПО
	|	Компьютеры.Наименование";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПК = Новый Структура;
		СтруктураПК.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураПК.Вставить("Активен", Выборка.Активен);
		Представление = СформироватьПредставлениеКомпьютераНаСервере(Выборка.Наименование, Выборка.Код);
		Если Не Выборка.Активен Тогда
			Представление = Представление + " [неактивен]";
		КонецЕсли;
		СтруктураПК.Вставить("Представление", Представление);
		Результат.Добавить(СтруктураПК);
	КонецЦикла;

	Возврат Результат;
КонецФункции

&НаСервере
Функция СформироватьПредставлениеКомпьютераНаСервере(Знач Наименование, Знач Код)
	Имя = СокрЛП(Строка(Наименование));
	КодСтрокой = СокрЛП(Строка(Код));
	Если ЗначениеЗаполнено(КодСтрокой) Тогда
		Возврат Имя + " (" + КодСтрокой + ")";
	КонецЕсли;
	Возврат Имя;
КонецФункции

&НаСервере
Функция НайтиСсылкуКомпьютераНаСервере(Знач Компьютер)
	Если Компьютер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Компьютер) = Тип("СправочникСсылка.АС_КомпьютерыAria") Тогда
		Возврат Компьютер;
	КонецЕсли;
	
	Поиск = СокрЛП(Строка(Компьютер));
	Если Не ЗначениеЗаполнено(Поиск) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Компьютеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.Наименование = &Поиск
	|	ИЛИ Компьютеры.Код = &Поиск";
	Запрос.УстановитьПараметр("Поиск", Поиск);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция СформироватьПонятноеСообщениеОшибки(ТехническийТекст)
	Текст = СокрЛП(Строка(ТехническийТекст));
	НижнийТекст = НРег(Текст);
	
	Если СтрНайти(НижнийТекст, "не удалось установить подключение") > 0 ИЛИ СтрНайти(НижнийТекст, "ошибка подключения") > 0 ИЛИ СтрНайти(НижнийТекст, "aria_ping") > 0 Тогда
		Возврат "Не удалось установить подключение. Проверьте работу службы на этом компьютере.";
	КонецЕсли;
	
	Если СтрНайти(НижнийТекст, "контрагент") > 0 И СтрНайти(НижнийТекст, "компьютер") > 0 Тогда
		Возврат "Для заполнения документа выберите контрагента и компьютер.";
	КонецЕсли;
	
	Если СтрНайти(НижнийТекст, "портmelezh") > 0 Тогда
		Возврат "Не задан порт Melezh в настройках программы для выбранного контрагента.";
	КонецЕсли;
	
	Если СтрНайти(НижнийТекст, "ipустройства") > 0 Тогда
		Возврат "У выбранного компьютера не заполнен IP устройства.";
	КонецЕсли;
	
	Если СтрНайти(НижнийТекст, "метадан") > 0 Тогда
		Возврат "Программа вернула неполный ответ. Повторите попытку позже.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат "Не удалось заполнить документ данными из программы.";
	КонецЕсли;
	
	Возврат "Не удалось заполнить документ: " + Текст;
КонецФункции

&НаСервере
Функция ЗначениеВСтроку(Значение)
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат Строка(Значение);
КонецФункции

//- BAS 24.05.2026 : Заполнение документа через общий модуль Melezh
